app/controllers/applicants_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "11"], ["password_digest", "$2a$10$NOe5BoHlO/z8QlUxnu0dMu9vKJh1He12ZvKl4PSZzyMQgIF96Y.6C"], ["created_at", "2018-11-28 11:59:52.107932"], ["updated_at", "2018-11-28 11:59:52.107932"]]