app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews" WHERE (coursename='模式识别与机器学习')
SELECT AVG("reviews"."ratingone") FROM "reviews" WHERE (coursename='模式识别与机器学习')
SELECT AVG("reviews"."ratingtwo") FROM "reviews" WHERE (coursename='模式识别与机器学习')
SELECT AVG("reviews"."ratingthree") FROM "reviews" WHERE (coursename='模式识别与机器学习')
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id)   # look up movie by unique ID
    # will render app/views/movies/show.<extension> by default
    showtitle = @movie.title
    @reviews =Review.where("coursename=?",showtitle)
    @rating1 =@reviews.average(:ratingone)
    @rating2 =@reviews.average(:ratingtwo)
    @rating3 =@reviews.average(:ratingthree)

SELECT "movies".* FROM "movies"
SELECT AVG("reviews"."ratingone") FROM "reviews" WHERE (coursename='模式识别与机器学习')
SELECT AVG("reviews"."ratingtwo") FROM "reviews" WHERE (coursename='模式识别与机器学习')
SELECT AVG("reviews"."ratingthree") FROM "reviews" WHERE (coursename='模式识别与机器学习')
---
  def index
    @movies = Movie.all
    @movies.each do |movie|
       @rating11=Review.where("coursename=?",movie.title).average(:ratingone)
       @rating22=Review.where("coursename=?",movie.title).average(:ratingtwo)
       @rating33=Review.where("coursename=?",movie.title).average(:ratingthree)

INSERT INTO "movies" ("title", "credit", "classhour", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "高级软件工程"], ["credit", 3], ["classhour", 40], ["description", "ruby&rail学习"], ["created_at", "2018-12-08 01:08:37.201745"], ["updated_at", "2018-12-08 01:08:37.201745"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "linux系统源码剖析1111"], ["updated_at", "2018-12-08 01:12:43.623343"], ["id", 6]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)