app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @review = Review.find params[:id]

INSERT INTO "reviews" ("username", "coursename", "ratingone", "ratingtwo", "ratingthree", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @review = Review.create!(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "reviews" SET "ratingone" = ?, "ratingtwo" = ?, "ratingthree" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["ratingone", 5.0], ["ratingtwo", 1.0], ["ratingthree", 5.0], ["updated_at", "2018-12-08 01:19:54.505571"], ["id", 7]]
---
  def update
    @review = Review.find params[:id]
    @review.update_attributes!(review_params)